Repository: krolmic/tracking_app
Catalog: tracking_flutter/lib/l10n/app_*.arb
Languages: de

# appDescription
source: Healthy Hustle is there to improve your work-life balance. Track your daily mood and work to identify how both are connected.
de: Healthy Hustle hilft dir deine Work-Life Balance zu verbessern. Zeichne täglich deine Stimmung und Arbeit auf, um herauszufinden, wie beide zusammenhängen.

source: Track your mood
de: Zeichne deine Stimmung auf

# trackYourMoodDescription
source: Estimate your mood and optionally write down what you're grateful for.
de: Schätze deine Stimmung ein und schreibe optional wofür du dankbar bist.

source: Track your work
de: Zeichne deine Arbeit auf

# trackYourWorkDescription
source: To identify how your work influences your mood track your daily revenue and work time.
de: Um herauszufinden, wie deine Arbeit deine Stimmung beeinflusst, zeichne deinen Umsatz und wie lange du gearbeitet hast auf.

# sayHelloToCalendar
source: Mood Calendar
de: Stimmungs-Kalender

source: Monthly overview
de: Monatlicher Überblick

# monthlyOverviewDescription
source: The calendar gets you a monthly overview of tracked days.
de: Der Kalender gibt dir einen monatlichen Überblick über deine aufgezeichneten Einträge.

source: Update days
de: Tage aktualisieren

# updateDaysDescription
source: Update your tracked entries anytime in the calendar view.
de: Bearbeite jederzeit aufgezeichnete Einträge in der Kalenderansicht.

source: Add missed days
de: Verpasste Tage hinzufügen

# addMissedDaysDescription
source: Add entries in the past to get full overview of your mood and work.
de: Füge Einträge aus der Vergangenheit hinzu, um deinen Fortschritt zu vervollständigen.

# giveVisitToAnalysis
source: Mood Analysis
de: Stimmungs-Analyse

source: Analyze your progress
de: Analysiere deinen Fortschritt

# analyzeYourProgressDescription
source: Get better understanding of the correlation between your mood and work by using the chart.
de: Bekomme ein besseres Verständnis der Korrelation zwischen deiner Stimmung und Arbeit.

source: Show tracked data
de: Zeige aufgezeichnete Daten

# showTrackedDataDescription
source: Select day in the line chart to get tracked mood and work details.
de: Wähle einen Tag im Diagramm aus um Details zu dem aufgezeichneten Eintrag zu sehen.

source: Get highest values
de: Höchste Werte

# getHighestValuesDescription
source: Get your best mood, longest work time, and highest revenue values in the selected time range.
de: Finde deine beste Stimmung, längste Arbeitszeit und höchsten Umsatz im ausgewählten Zeitraum heraus.

# appInitFailed
source: App initialization failed.
de: Fehler bei Initialisierung der App.

# trackMood
source: Track
de: Hinzufügen

source: Track today
de: Heute aufzeichnen

source: Update today
de: Heute ändern

source: Mood tracked successfully!
de: Stimung erfolgreich aufgezeichnet!

# somethingWentWrong
source: Something went wrong here. Please try again.
de: Hier ist etwas schiefgegangen. Bitte versuche es erneut.

# howAreYouFeeling
source: Mood estimation
de: Schätze deine Stimmung ein

# estimateYourMood
source: Take a deep breath and estimate your mood on a scale from 1 to 10.
de: Atme tief durch und schätze deine Stimmung auf einer Skala von 1 bis 10.

# whatAreYouGreatfulFor
source: What are you grateful for?
de: Wofür bist du dankbar?

# writeDownThingsYouAreGreatfulFor
source: Write down 3 things you're grateful for.
de: Schreibe 3 Dinge auf.

# affirmation1
source: Love and support I experienced
de: Liebe und Unterstützung, die ich bekommen habe

# affirmation2
source: The challenge that makes me grow
de: Die Herausforderung, die mich wachsen lässt

# affirmation3
source: Unterstanding and compassion I received
de: Verständnis und Geduld

source: How much did you earn?
de: Wie viel hast du eingenommen?

# howMuchDidYouEarnDescription
source: Track your revenue so you can see how it correlates with your mood.
de: Zeichne deinen Umsatz auf, um zu sehen, wie er sich auf deine Stimmung auswirkt.

source: How long did you work?
de: Wie lange hast du gearbeitet?

# howLongDidYouWorkDescription
source: Track your work time to see how it correlates with your mood.
de: Zeichne deine Arbeitszeit auf, um zu sehen, wie sie sich auf deine Stimmung auswirkt.

source: hours
de: Stunden

source: minutes
de: Minuten

# yourWorkTime
source: Select work time
de: Wähle die Arbeitszeit

# recommandedWorkTimeExceeded
source: You have exceeded the recommended work time of 6 hours.
de: Du hast die empfohlene Arbeitszeit von 6 Stunden überschritten.

# revenueHelper
source: Revenue in {currency}
de: Umsatz in {currency}

# weekProgress
source: Your progress this week
de: Dein Fortschritt diese Woche

# progressDoingGreat
source: Be proud of yourself!
de: Sei stolz auf dich!

# progressDoingGood
source: You got this!
de: Du schaffst das!

# progressTrackedEveryDay
source: You have tracked your mood every day this week.
de: Du hast diese Woche jeden Tag deine Stimmung aufgezeichnet.

# progressTrackedAlmostEveryDay
source: Complete your progress by using the calendar.
de: Vervollständige deinen Fortschritt im Kalender.

# progressTrackNow
source: Track your mood to evaluate your progress.
de: Zeichne deine heutige Stimmung und Arbeit auf.

source: Average mood
de: Durchschn. Stimmung

# averageWorkHours
source: Average work time
de: Durchschn. Arbeitszeit

source: Average revenue
de: Durchschn. Umsatz

source: Recently tracked
de: Zuletzt aufgezeichnet

source: See all
de: Alle anzeigen

# moodHistoryTitle
source: All entries
de: Alle Einträge

source: Good morning,
de: Guten Morgen,

source: Good afternoon,
de: Guten Tag,

source: Good evening,
de: Guten Abend,

source: Today
de: Heute

source: Settings
de: Einstellungen

# signOutMessage
source: Are you sure you want to sign out?
de: Bist du dir sicher, dass du dich ausloggen möchtest?

source: Cancel
de: Abbrechen

source: Delete account
de: Account löschen

source: Account deletion
de: Account Löschen

# accountDeletionMessage
source: All your data will be deleted. Are you sure you want to delete your account?
de: Alle deine Daten werden gelöscht. Bist du dir sicher, dass dein Account gelöscht werden soll?

source: Delete
de: Löschen

# selectEmoji
source: Select your Hustle animal
de: Wähle dein Hustle-Tier

# emojiUpdatedSuccessfully
source: Hustle animal updated successfully!
de: Hustle-Tier erfolgreich geändert!

source: Personal details
de: Persönliche Details

source: General
de: Allgemein

source: Terms of service
de: Nutzungsbedingungen

source: Privacy policy
de: Datenschutz

# moodUpdatedSuccessfully
source: Entry updated successfully!
de: Eintrag erfolgreich geändert!

# moodDeletedSuccessfully
source: Entry deleted successfully!
de: Eintrag erfolgreich gelöscht!

# updateMood
source: Update
de: Ändern

# deleteMood
source: Delete entry
de: Eintrag löschen

# deleteMoodMessage
source: Are you sure you want to delete this entry?
de: Sicher, dass du diesen Eintrag löschen möchtest?

source: Profile updated successfully!
de: Persönliche Details erfolgreich editiert!

source: Calendar
de: Kalender

# trackedMood
source: Tracked entries
de: Aufgezeichnete Einträge

# noTrackedMood
source: You have not tracked any days in the selected month.
de: In dem ausgewählten Monat wurden keine Tage aufgezeichnet.

source: Analysis
de: Analyse

# greatestMood
source: Best mood
de: Beste Stimmung

# greatestWorkTime
source: Longest work time
de: Längste Arbeitszeit

# greatestRevenue
source: Highest revenue
de: Höchster Umsatz

source: Mood
de: Stimmung

source: Work time
de: Arbeitszeit

source: Revenue
de: Umsatz

source: Show revenue
de: Umsatz anzeigen

source: Show work time
de: Arbeitszeit anzeigen

source: Mode
de: Modus

source: Monthly
de: Monatlich

source: Weekly
de: Wöchentlich

# savingGraphSettingsFailed
source: Saving display settings failed. They won't be applied next time you open the app.
de: Speichern der Anzeigeeinstellungen fehlgeschlagen. Sie werden beim nächsten App-Start nicht übernommen.

# calendarWeek
source: CW {weekNumber}
de: KW {weekNumber}

source: Display
de: Anzeige

source: Lines
de: Linien

# appSettings
source: Preferences
de: Präferenzen

# appSettingsSaved
source: Preferences saved successfully!
de: Präferenzen erfolgreich gespeichert!

source: Currency
de: Währung

# currencySettingDescription
source: Currency to display symbol of for revenue tracking
de: Symbol der ausgewählten Währung wird in der App angezeigt

source: Common currencies
de: Häufige Währungen

source: Other currencies
de: Andere Währungen

source: Preset revenue
de: Voreingestellter Umsatz

# presetRevenueDescription
source: Revenue preset for quick tracking
de: Voreingestellter Umsatz wird automatisch eingetragen

source: Preset work time
de: Voreingestellte Arbeitszeit

# presetWorkTimeDescription
source: Work time preset for quick tracking
de: Voreingestellte Arbeitszeit wird automatisch eingetragen

source: Update
de: Ändern

# givenNameMustNotBeBlank
source: Write how I should call you in the app.
de: Schreibe, wie ich dich in der App nennen soll.

# subscriptionPurchaseSuccessful
source: You have now unlimited access to the app!
de: Du kannst die App jetzt unbeschränkt nutzen! Danke für deine Unterstützung. 💙

# subscriptionPurchaseFailed
source: Error during purchase. Please try again.
de: Fehler beim Kauf. Bitte versuche es erneut.

# subscriptionPurchaseCancelled
source: You need a subscription to use this feature.
de: Um diese Funktion zu nutzen, benötigst du Premium. So unterstützt du auch die Weiterentwicklung der App. 💙

# subscriptionPurchaseRestored
source: Your subscription has been restored.
de: Premium wiederhergestellt. Danke für deine Unterstützung. 💙

source: Sign In
de: Anmeldung

source: Sign Up
de: Registrierung

source: Confirm
de: Bestätigen

# continueLabel
source: Continue
de: Weiter

source: Submit
de: Absenden

source: Change Password
de: Passwort ändern

# sendCode
source: Send code again
de: Code erneut anfordern

# lostCode
source: Lost your code?
de: Code verloren?

source: Verify
de: Verifizieren

source: Sign Out
de: Ausloggen

# signInWith
source: Sign In with {provider}
de: Anmelden mit {provider}

source: No account?
de: Kein Nutzerkonto?

# haveAccount
source: Have an account?
de: Nutzerkonto vorhanden?

# forgotPassword
source: Forgot your password?
de: Passwort vergessen?

# confirmResetPassword
source: Reset Password
de: Passwort zurücksetzen

# backTo
source: Back to {previousStep}
de: Zurück zu {previousStep}

source: Skip
de: Überspringen

source: Copy Key
de: Schlüssel kopieren

source: Confirm Sign-up
de: Registrierung bestätigen

# confirmSignInMfa
source: Confirm Sign-in
de: Anmeldung bestätigen

# confirmSignInNewPassword
source: Confirm Sign-in
de: Anmeldung bestätigen

source: Reset Password
de: Passwort zurücksetzen

source: Verify User
de: Nutzer Verifizieren

source: Confirm Verify User
de: Nutzer Verifizieren bestätigen

source: Username
de: Nutzername

source: Password
de: Passwort

source: New Password
de: Neues Passwort

# passwordConfirmation
source: Confirm Password
de: Passwort bestätigen

source: Verification Code
de: Verifizierungscode

# customAuthChallenge
source: Confirmation Code
de: Bestätigungscode

source: Address
de: Adresse

source: Birthdate
de: Geburtsdatum

source: Family Name
de: Familienname

source: Gender
de: Geschlecht

# givenName
source: First Name
de: Vorname

source: Middle Name
de: Zweiter Vorname

source: Phone Number
de: Telefonnummer

source: Preferred Username
de: Präferierter Nutzername

source: Remember Device?
de: Gerät merken

# selectSms
source: Text Message (SMS)
de: Textnachricht (SMS)

# totpCodePrompt
source: Please enter the code from your registered Authenticator app
de: Bitte gebe den Code aus deiner registrierten Authenticator App ein

# usernameType
source: Log in using:
de: Zur Anmeldung verwenden:

# promptFill
source: Enter your {attribute}
de: {attribute} eingeben

# promptRefill
source: Re-enter your {attribute}
de: {attribute} erneut eingeben

# warnEmpty
source: {attribute} field must not be blank.
de: Feld {attribute} darf nicht leer sein.

# warnInvalidFormat
source: Invalid {attributeType} format.
de: {attributeType} hat inkorrektes Format.

# usernameRequirements
source: Username must only contain alphanumeric characters and symbols.
de: Nutzername darf nur alphanumerische Zeichen und Sonderzeichen beinhalten.

# passwordRequirementsPreamble
source: Your password must include:
de: Dein Password muss Folgendes beinhalten:

# passwordRequirementsAtLeast
source: at least {numCharacters, plural, =1{1{characterType} character} other{{numCharacters}{characterType} characters}}
de: mindestens {numCharacters, plural, =1{1{characterType}} other{{numCharacters}{characterType} Zeichen}}

# passwordRequirementsCharacterType
source: {characterType, select, requiresUppercase{uppercase} requiresLowercase{lowercase} requiresNumbers{number} requiresSymbols{symbol} other{}}
de: {characterType, select, requiresUppercase{Großbuchstabe} requiresLowercase{Kleinbuchstabe} requiresNumbers{Zahl} requiresSymbols{Sonderzeichen} other{}}

# codeSent
source: A confirmation code has been sent to {destination}
de: Bestätigungscode wurde gesendet an {destination}

# codeSentUnknown
source: A confirmation code has been sent.
de: Bestätigungscode wurde versendet.

# copySucceeded
source: Copied to clipboard!
de: In die Zwischenablage kopiert!

# copyFailed
source: Copy to clipboard failed.
de: Fehler beim Kopieren in die Zwischenablage.

# confirmSignInCustomAuth
source: Enter your sign in code'
de: Gebe deinen Code zur Anmeldung ein'

# continueSignInWithMfaSelection
source: Select your preferred Two-Factor Auth method
de: Wähle deine bevorzugte Methode für die Zwei-Faktor-Authentisierung aus

# continueSignInWithTotpSetup
source: Enable Two-Factor Auth
de: Zwei-Faktor-Authentisierung Aktivieren

# confirmSignInWithTotpMfaCode
source: Enter your one-time passcode
de: Gebe dein Einmal-Passwort ein
